DataProcessors/Renault_ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ШтрихКоды</Name>
			<Comment>Штрих коды</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Номенклатура или карточка</Comment>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
					<Comment>Состав</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Comment>Владелец штрихкода</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
								<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Comment>Штрихкод</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запрещен</Name>
							<Comment>Флаг запрета штрихкода</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<Comment>В регистре хранятся сведения о штрих-кодах на товары и карточки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыгружатьВОборудование</Name>
					<Comment>Признак выгрузки ШК в торговое оборудование с памятью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Штрих-код запрещен. Любые действия с этим штрих-кодом запрещены.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих-код товара или карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект штрих-кода (номенклатура или карточка)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ШтрихКоды</Name>
			<Comment>В регистре хранятся сведения о штрих-кодах на товары и карточки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Штрих-код запрещен. Любые действия с этим штрих-кодом запрещены.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих-код товара или карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект штрих-кода (номенклатура или карточка)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_СертификатКонтроля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗапрещенныеШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗапрещенныеШтрихКоды</Name>
			<Comment>Список запрещенных штрих кодов (можно задавать по маске)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтоПрефикс</Name>
					<Comment>Истина - это префикс штрих кода, Ложь - это штрихкод</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих код (или префикс). Префикс задается тем, что после цифр указывается символ *</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_ШтрихКоды/Ext/ObjectModule.bsl
#Если Клиент Тогда
Перем НаборСлучайных; // Набор случайных чисел
Перем ИндексСлучайных; // Индекс случайных чисел
Перем ПрефиксВесовогоШК; // Берется из константы ПрефиксВесовогоШК
Перем ПрефиксШтучногоШК; // Берется из константы ПрефиксШтучногоШК

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ШТРИХ КОДА МЕТОДОМ СЛУЧАЙНОЙ ПОСЛЕДОВАТЕЛЬНОСТИ 
// (не используется)

// Функция Округляет число до ближайшего верхнего целого
//
// Параметры:
//  Значение - число - значение для округления
//
// Возвращаемое значение:
//  ВремЗначение - число - результат округления.
//
Функция ОкрВверх(Значение)
	ВремЗначение = Цел(Значение);
	Если Значение > ВремЗначение Тогда
		Возврат ВремЗначение + 1;
	Иначе
		Возврат ВремЗначение;
	КонецЕсли;
КонецФункции // ОкрВверх()

// обновляет набор случайных индексов (для увеличения быстродействия)
//
//Процедура ОбновитьНаборСлучайных()
//	// инициализируем случайную последовательность
//	Если ИндексСлучайных=Неопределено ИЛИ НаборСлучайных=Неопределено Тогда
//		ИнициализацияСлучайнойПоследовательности();
//	КонецЕсли;
//	
//	НаборСлучайных[0] = НаборСлучайных[0]+0.0101;
//	Если НаборСлучайных[0]>=1 Тогда НаборСлучайных[0]=0.2354 КонецЕсли;
//	НаборСлучайных[1] = НаборСлучайных[1]+0.0101;
//	Если НаборСлучайных[1]>=1 Тогда НаборСлучайных[1]=0.5378 КонецЕсли;
//	НаборСлучайных[2] = НаборСлучайных[2]+0.0101;
//	Если НаборСлучайных[2]>=1 Тогда НаборСлучайных[2]=0.0932 КонецЕсли;
//	НаборСлучайных[3] = НаборСлучайных[3]+0.0101;
//	Если НаборСлучайных[3]>=1 Тогда НаборСлучайных[3]=0.9084 КонецЕсли;
//	НаборСлучайных[4] = НаборСлучайных[4]+0.0101;
//	Если НаборСлучайных[4]>=1 Тогда НаборСлучайных[4]=0.3490 КонецЕсли;
//	НаборСлучайных[5] = НаборСлучайных[5]+0.0101;
//	Если НаборСлучайных[5]>=1 Тогда НаборСлучайных[5]=0.3489 КонецЕсли;
//	НаборСлучайных[6] = НаборСлучайных[6]+0.0101;
//	Если НаборСлучайных[6]>=1 Тогда НаборСлучайных[6]=0.4884 КонецЕсли;
//	НаборСлучайных[7] = НаборСлучайных[7]+0.0101;
//	Если НаборСлучайных[7]>=1 Тогда НаборСлучайных[7]=0.8477 КонецЕсли;
//КонецПроцедуры // ОбновитьНаборСлучайных()

// Функция Возвращает псевдослучайное число указанного порядка GOAN
// (порядок равен количеству цифр в числе, [1..4])
// Используется массив весовых Коэффициентов НаборСлучайных[]
//
// Параметры:
//  Порядок - порядок числа
//
// Возвращаемое значение:
//  получено число
//
Функция СлучайноеЧисло_МетодСлП(Порядок)
	Перем Р, С;
	
	// инициализируем случайную последовательность
	Если ИндексСлучайных=Неопределено ИЛИ НаборСлучайных=Неопределено Тогда
		ИнициализацияСлучайнойПоследовательности();
	КонецЕсли;
	
	С = 0;
	Для К = 0 По 7 Цикл
		СлучайноеЧисло = НаборСлучайных[К];
		С = С + СлучайноеЧисло;
	КонецЦикла;
	Р = С - Цел(С);
	ИндексСлучайных = ИндексСлучайных + 1;
	Если ИндексСлучайных > 7 Тогда
		ИндексСлучайных = 1;
	КонецЕсли;
	НаборСлучайных[ИндексСлучайных] = Р;
	С = 1;
	Для К = 0 По Порядок-1 Цикл
		С = С * 10;
	КонецЦикла;
	Возврат Цел(Р * С);
КонецФункции // СлучайноеЧисло()

// Процедура создание новой условно случайной последовательности с указанным смещением GOAN
// Смещение рекомендуется задавать в виде трехзначного числа
// Используется массив весовых Коэффициентов НаборСлучайных[]
//
Процедура ИнициализацияСлучайнойПоследовательности(Смещение = 0)
	Перем Ч, М, С, Р, Д, К;
	НаборСлучайных = Новый Массив(8);
	НаборСлучайных[0] = 0.2354;
	НаборСлучайных[1] = 0.5378;
	НаборСлучайных[2] = 0.0932;
	НаборСлучайных[3] = 0.9084;
	НаборСлучайных[4] = 0.3490;
	НаборСлучайных[5] = 0.3489;
	НаборСлучайных[6] = 0.4884;
	НаборСлучайных[7] = 0.8477;
	ИндексСлучайных = 0;
	ТекДата = ТекущаяДата();
	Д = ДеньГода(ТекДата) % 1000;
	Ч = Час(ТекДата);
	М = Минута(ТекДата);
	С = Секунда(ТекДата);
	Р = Ч + М + С + Д + Смещение;
	Для К = 1 По Р Цикл
		СлучайноеЧисло_МетодСлП(0); // Простая инициализация новых значений
	КонецЦикла;
КонецПроцедуры // ИнициализацияСлучайнойПоследовательности()

// Формирует случайный код в произвольном алфавитно-цифровом формате (для служебных целей)
// Возвращает строку чисел если АлфавитноЦифровой=0 и буквенно-цифровую A-Z&0-9 иначе
//
// Параметры:
//  КоличествоЗнаков - число - длина кода,
//  АлфавитноЦифровой - число определяет тип кода.
//
// Возвращаемое значение:
//  Стр - строка - сформированный произвольный код.
//
Функция СформироватьПроизвольныйКод_МетодСлП(КоличествоЗнаков = 22, АлфавитноЦифровой = 0) Экспорт
	Стр = "";
	Если АлфавитноЦифровой = 0 Тогда // Только числа
		Для К = 1 По ОкрВверх(КоличествоЗнаков / 4) Цикл
			Стр = Стр + Формат(СлучайноеЧисло_МетодСлП(4),"ЧЦ=4; ЧН=; ЧВН=; ЧГ=0");
		КонецЦикла;
		Возврат Лев(Стр, КоличествоЗнаков);
	Иначе            				 // Числа и символы A - Z
		Пока СтрДлина(Стр) < КоличествоЗнаков Цикл
			Ч = СлучайноеЧисло_МетодСлП(1);
			Если Ч % 2 = 0 Тогда
				// Берем цифру
				Стр = Стр + Строка(СлучайноеЧисло_МетодСлП(1));
			Иначе
				// Берем букву
				Стр = Стр + Символ(65 + (СлучайноеЧисло_МетодСлП(2) % 26)); // A - Z
			КонецЕсли;
		КонецЦикла;
		Возврат Стр;
	КонецЕсли;
КонецФункции // СформироватьПроизвольныйКод()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ШТРИХ КОДА МЕТОДОМ ГЕНЕРАЦИИ GUID

// Функция Возвращает псевдослучайное число указанного порядка
// (порядок равен количеству цифр в числе, [1..10])
// Используется генератор GUID
//
// Параметры:
//  Порядок - порядок числа
//
// Возвращаемое значение:
//  получено число
//
Функция СлучайноеЧисло(Порядок)
	
	Мин = 0;   //минимальное допустимое значение произвольного кода
	Макс = 1;  //максимальное допустимое значение произвольного кода
    Для х = 0 По Порядок - 1 Цикл 
        Макс = Макс * 10; 
	КонецЦикла;       
	Макс = Макс-1;
	
	//генерируем GUID и оставляем только цифры
    НовыйУИ = СокрЛП(Новый УникальныйИдентификатор);
    НовыйУИ = СтрЗаменить(НовыйУИ,"-","");
    НовыйУИ = СтрЗаменить(НовыйУИ,"a","");
    НовыйУИ = СтрЗаменить(НовыйУИ,"b","");
    НовыйУИ = СтрЗаменить(НовыйУИ,"c","");
    НовыйУИ = СтрЗаменить(НовыйУИ,"d","");
    НовыйУИ = СтрЗаменить(НовыйУИ,"e","");
    НовыйУИ = СтрЗаменить(НовыйУИ,"f","");
	
    //знаменатель должен иметь такое же количество нулей + 1
    Знаменатель = 10;
    Для н = 2 По (СтрДлина(СтрЗаменить(НовыйУИ,Символы.НПП,""))) Цикл
        Знаменатель = Знаменатель * 10;
    КонецЦикла; 
	
	//получим дробное случайное число в диапазоне от 0 до 1
    Случ = Число(НовыйУИ) / Знаменатель;     
	
    //преобразуем его в случайное число из заданного интервала, округляем до целого
    ЧислоИзИнтервала = Мин(Макс(Окр(Мин + (Макс-Мин)*Случ),Мин),Макс);
	Возврат ЧислоИзИнтервала;
	
КонецФункции // СлучайноеЧисло()

// Формирует случайный код в произвольном алфавитно-цифровом формате
// Используется генератор GUID
// Возвращает строку чисел если АлфавитноЦифровой=0 и буквенно-цифровую A-Z&0-9 иначе
//
// Параметры:
//  КоличествоЗнаков - число - длина кода,
//  АлфавитноЦифровой - число определяет тип кода.
//
// Возвращаемое значение:
//  Стр - строка - сформированный произвольный код.
//
Функция СформироватьПроизвольныйКод(КоличествоЗнаков = 22, АлфавитноЦифровой = 0) Экспорт

	Стр = "";
	Если АлфавитноЦифровой = 0 Тогда // Только числа
		Для К = 1 По ОкрВверх(КоличествоЗнаков / 10) Цикл
			Стр = Стр + Формат(СлучайноеЧисло(10),"ЧЦ=10; ЧН=; ЧВН=; ЧГ=0");
		КонецЦикла;
		Возврат Лев(Стр, КоличествоЗнаков);
	Иначе            				 // Числа и символы A - Z
		Возврат СформироватьПроизвольныйКод_МетодСлП(КоличествоЗнаков, АлфавитноЦифровой);
	КонецЕсли;
	
КонецФункции // СформироватьПроизвольныйКод()

// Функция, приводящая строку к необходимой длине строки символом
//
// Параметры:
//  Реж    - число -  1 - добавлять символы слева, 2 - справа, 3 - слева и справа
//  Стр    - строка - строка которую редактируем,
//  Символ - строка - символ, который вставляем,
//  Длина  - Число - длина до которой приводим.
//
// Возвращаемое значение:
//  Стр - строка - результат редактирования строки.
//
Функция СтрокаПривести(Стр,Символ,Длина,Реж=1)
	ДопСтр=""; Сч=Длина-СтрДлина(Стр);
	Если Сч>0  Тогда
		Для к=1 По Сч Цикл
			ДопСтр=ДопСтр+Символ;
		КонецЦикла;
		Если Реж=1 Тогда Возврат ДопСтр+Стр;
		ИначеЕсли Реж=2 Тогда Возврат Стр+ДопСтр;
		Иначе к=Окр(Сч/2); Возврат Лев(ДопСтр,к)+Стр+Прав(ДопСтр,Сч-к);
		КонецЕсли;
	Иначе Возврат Стр;
	КонецЕсли;
КонецФункции // СтрокаПривести()

// Вычисляет контрольную цифру EAN-13/EAN-8  GOAN
// Возвращает штрих-код с контрольной цифрой
//
// Параметры:
//  Код - строка - код, по которому вычисляем контрольную цифру.
//
// Возвращаемое значение:
//  Рез - Строка - штрих-код с контрольной цифрой. 
//
Функция EAN13(Код) Экспорт
	ШтрКод = Формат(Число(Код),"ЧН=; ЧВН=; ЧГ=0; ЧЦ="+?(СтрДлина(Код)<8,"7","12"));
	Четн = 0; Нечетн = 0;
	Если СтрДлина(Код)=7 Тогда Итераций = 4; 
	Иначе Итераций = 6; 
	КонецЕсли;
	Для Индекс=1 По Итераций Цикл
		Четн=Четн+Сред(ШтрКод,2*Индекс,1);
		Нечетн=Нечетн+Сред(ШтрКод,2*Индекс-1,1);
	КонецЦикла;
	Если СтрДлина(Код)=7 Тогда Нечетн=Нечетн*3; 
	Иначе Четн=Четн*3;
	КонецЕсли;
	КонтЦифра=10-(Четн+Нечетн)%10;
	Если КонтЦифра=10 Тогда КонтЦифра=0;КонецЕсли;
	Рез=ШтрКод+Строка(КонтЦифра);
	Возврат Рез;
КонецФункции // EAN13()

// Формирует штрих-код в формате EAN-13 для товара
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  ШтрихКод
Функция СформироватьШтрихКодТовара(Весовой=Ложь) Экспорт
	СчПопыток=0;
	
	Если Весовой Тогда
	    К = 5; //Для весового товара длина штрихкода 7 (2 - префикс)
		ПрефиксКода = Строка(ПрефиксВесовогоШК);
		НовыйКод = ПрефиксКода + СтрокаПривести(СформироватьПроизвольныйКод(К), "0", 4, 2);
		Пока НЕ ШтрихКодУникален(НовыйКод) ИЛИ ШтрихКодЗапрещен(НовыйКод) Цикл
			НовыйКод = ПрефиксКода + СтрокаПривести(СформироватьПроизвольныйКод(К), "0", 4, 2);
			СчПопыток=СчПопыток+1;
			Если СчПопыток=50 Тогда
				СчПопыток=0; 
			КонецЕсли;
		КонецЦикла;
	Иначе
		К = 10;	//Для невесового товара длина штрихкода 12 (2 - префикс)
		ПрефиксКода = ПрефиксШтучногоШК;
		НовыйКод = EAN13(Строка(ПрефиксКода) + СтрокаПривести(СформироватьПроизвольныйКод(К), "0", 10, 2));
		Пока НЕ ШтрихКодУникален(НовыйКод) ИЛИ ШтрихКодЗапрещен(НовыйКод) Цикл
			НовыйКод = EAN13(Строка(ПрефиксКода) + СтрокаПривести(СформироватьПроизвольныйКод(К), "0", 10, 2));
			СчПопыток=СчПопыток+1;
			Если СчПопыток=50 Тогда
				СчПопыток=0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	Возврат НовыйКод;    
КонецФункции // СформироватьШтрихКод()

// Формирует ручной код товара в диапазоне 1..9999
//
// Возвращаемое значение:
//  НовыйКод - Строка - ручной код.
//
Функция СформироватьРучнойКодТовара() Экспорт
	// получим существующие ручные коды
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ПОДСТРОКА(ШтрихКоды.ШтрихКод,1,4)=ШтрихКоды.ШтрихКод");
	СписокИмеющихсяКодов=Новый СписокЗначений();
	СписокИмеющихсяКодов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихКод"));
	
	НовыйКод="";
	// формируем код
	Для Сч=1 По 9999 Цикл
		НовыйКод=Формат(Сч,"ЧГ=0");
		// 1. нет ли такого кода в списке имеющихся
		Если СписокИмеющихсяКодов.НайтиПоЗначению(НовыйКод)<>Неопределено Тогда Продолжить; КонецЕсли;
		// 2. нет ли нашего кода в списке запрещенных
		Если ШтрихКодЗапрещен(НовыйКод) Тогда Продолжить; КонецЕсли;
		// проверки прошли
		Прервать;
	КонецЦикла;
	
	Возврат НовыйКод;    
КонецФункции // СформироватьШтрихКод()

// Формирует штрих-код карточки для товара
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  ШтрихКод
Функция СформироватьШтрихКодКарточки(ДлинаКода) Экспорт
	НовыйКод = СформироватьПроизвольныйКод(ДлинаКода);
	Пока НЕ ШтрихКодУникален(НовыйКод) Цикл
		НовыйКод = СформироватьПроизвольныйКод(ДлинаКода);
	КонецЦикла;
	Возврат НовыйКод;    
КонецФункции // СформироватьШтрихКод()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ТАБЛИЧНОЙ ЧАСТЬЮ СОСТАВ

// Процедура заполняет табличную часть обработки штрихкодами объекта.
// Объект - объект, штрихкоды которого отбираются.
//
// Параметры:
//  Нет.
//
Процедура ПрочитатьЗаполнитьШтрихКоды() Экспорт
	Запрос = Новый Запрос();	
    Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Если ТипЗнч(Объект)=Тип("СправочникОбъект.Номенклатура") И НЕ Объект = Неопределено Тогда
		ИспользованиеШтрихКодов=Объект.ТипНоменклатуры.ИспользованиеШтрихКодов;
		Если ИспользованиеШтрихКодов=2 Тогда
			// используем ШК для единиц
			ПодчинитьТипу=(Объект.ТипНоменклатуры.ИспользованиеЕдиницИзмерения=1);
		ИначеЕсли ИспользованиеШтрихКодов=3 Тогда
			// используем ШК для характеристик
			ПодчинитьТипу=(Объект.ТипНоменклатуры.ИспользованиеХарактеристик=1);
		КонецЕсли;
		ПодчинитьТипу=Ложь;
		// смотрим чему у нас подчинены единицы измерения и характеристики
		Если ИспользованиеШтрихКодов=Неопределено Тогда
			//Это для карточек
			ПодчинитьТипу=Неопределено;
		Иначе
			Если ИспользованиеШтрихКодов=2 Тогда
				// используем ШК для единиц
				ПодчинитьТипу=(Объект.ТипНоменклатуры.ИспользованиеЕдиницИзмерения=1);
			ИначеЕсли ИспользованиеШтрихКодов=3 Тогда
				// используем ШК для характеристик
				ПодчинитьТипу=(Объект.ТипНоменклатуры.ИспользованиеХарактеристик=1);
			КонецЕсли;
			Запрос.УстановитьПараметр("Владелец", ?(ПодчинитьТипу,Объект.ТипНоменклатуры,Объект.Ссылка));
		КонецЕсли;
		Запрос.УстановитьПараметр("Владелец", ?(ПодчинитьТипу,Объект.ТипНоменклатуры,Объект.Ссылка));
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Renault_ШтрихКоды."+?(ИспользованиеШтрихКодов=1,"Объект",?(ИспользованиеШтрихКодов=2,"ЕдиницаИзмерения","ХарактеристикаНоменклатуры"))+" КАК Объект,
		|	Renault_ШтрихКоды.ШтрихКод,
		|	Renault_ШтрихКоды.Запрет КАК Запрещен
		|ИЗ
		|	РегистрСведений.Renault_ШтрихКоды КАК Renault_ШтрихКоды
		|ГДЕ
		|	Renault_ШтрихКоды.Объект=&Ссылка
		|УПОРЯДОЧИТЬ ПО Объект
		|";
	Иначе
		Запрос.Текст="ВЫБРАТЬ
		             |	Renault_ШтрихКоды.Объект КАК Объект,
		             |	Renault_ШтрихКоды.ШтрихКод,
		             |	Renault_ШтрихКоды.Запрет КАК Запрещен
		             |ИЗ
		             |	РегистрСведений.Renault_ШтрихКоды КАК Renault_ШтрихКоды
		             |ГДЕ
		             |	Renault_ШтрихКоды.Объект = &Ссылка";
	КонецЕсли;  
	Состав.Очистить();
	Состав.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры // ПрочитатьЗаполнитьШтрихКоды()

// Функция записывает значения штрихкодов в информационную базу.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Истина - если значения штрихкоды были записаны, или их не требуется записывать
//  Ложь   - если значения штрихкоды не удалось записать.
Функция ЗаписатьШтрихКоды() Экспорт
	НаборЗаписейШтрихКоды = РегистрыСведений.Renault_ШтрихКоды.СоздатьНаборЗаписей();

	Если ТипЗнч(Объект)=Тип("СправочникОбъект.Номенклатура") Тогда
		ИспользованиеШтрихКодов = Объект.ТипНоменклатуры.ИспользованиеШтрихКодов;
	Иначе
		ИспользованиеШтрихКодов = Неопределено;
	КонецЕсли;
	
	Для Каждого Строка Из Состав Цикл
		//Строка.ШтрихКод=СокрЛП(Строка.ШтрихКод);
		Если обЗначениеНеЗаполнено(Строка.ШтрихКод) Тогда Продолжить; КонецЕсли;
		Если НЕ ШтрихКодУникален(Строка.ШтрихКод) Тогда
			Сообщить(Строка.ШтрихКод+" - штрихкод не уникален! Штрихкод не записан!",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		Если ШтрихКодЗапрещен(Строка.ШтрихКод) Тогда
			Сообщить(Строка.ШтрихКод+" - штрихкод запрещен! Штрихкод не записан!",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;
		
		Запись = НаборЗаписейШтрихКоды.Добавить();
		Запись.Объект   = Объект.Ссылка;
		Запись.ШтрихКод = Строка.ШтрихКод;
		Запись.Запрет = Строка.Запрещен;
		Если ИспользованиеШтрихКодов <> Неопределено Тогда
			Если ИспользованиеШтрихКодов = 2 Тогда
				Запись.ЕдиницаИзмерения = Строка.Объект;
			ИначеЕсли ИспользованиеШтрихКодов = 3 Тогда
				Запись.ХарактеристикаНоменклатуры = Строка.Объект;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;

	НаборЗаписейШтрихКоды.Отбор.Объект.Установить(Объект.Ссылка);

	Попытка
		НаборЗаписейШтрихкоды.Записать();
	Исключение
		Предупреждение("Не удалось записать штрихкод:" + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
КонецФункции // ЗаписатьШтрихКоды()

// Функция проверяет уникальность штрихкода
//
// Параметры
//  <ШтрихКод>  – Проверяемый штрихкод
//                 <продолжение описания параметра>
// Возвращаемое значение:
//  Истина - если код уникальный
//  Ложь   - если код неуникальный
Функция ШтрихКодУникален(ШтрихКод) Экспорт
	Если ПустаяСтрока(ШтрихКод) Тогда
		Возврат Истина; // проверять нечего, говорим что все Ок
	КонецЕсли;
	// первый шаг. Проверим уникальность ШК в регистре
	Запрос = Новый Запрос();
    Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Запрос.Текст = "
    |ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод,
	|	ШтрихКоды.Объект
	|ИЗ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
    |ГДЕ
	|	ШтрихКоды.ШтрихКод=&ШтрихКод И ШтрихКоды.Объект<>&Объект";

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		// проверку не прошел
	    Возврат Ложь;
	Иначе
		// шаг 2. Проверим уникальность ШК среди строк таблицы "Состав"
		МассивСтрок=Состав.НайтиСтроки(Новый Структура("ШтрихКод",ШтрихКод));
		Возврат (МассивСтрок.Количество()<2);
	КонецЕсли; 
	
КонецФункции // ШтрихКодУникален()

// Функция проверяет штрих код на наличие в списке запрещенных штрих кодов
//
// Параметры
//  <ШтрихКод>  – Проверяемый штрихкод
// Возвращаемое значение:
//  Истина - если код запрещен
//  Ложь   - если код разрешен
Функция ШтрихКодЗапрещен(ШтрихКод) Экспорт
	//ШК=СокрЛП(ШтрихКод);
	ШК=Строка(ШтрихКод);
	НайденныйШК="";
	// 1. ищем ШК
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	ЗапрещенныеШтрихКоды.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	РегистрСведений.ЗапрещенныеШтрихКоды КАК ЗапрещенныеШтрихКоды
	|ГДЕ
	|	НЕ ЗапрещенныеШтрихКоды.ЭтоПрефикс И ЗапрещенныеШтрихКоды.ШтрихКод = &ШтрихКод");
	Запрос.УстановитьПараметр("ШтрихКод",ШК);
	Результат=Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		НайденныйШК=Результат.Выгрузить().Получить(0).ШтрихКод;
	КонецЕсли;
	
	// 2. если не нашли ШК, то поищем префикс
	Если ПустаяСтрока(НайденныйШК) Тогда
		Запрос=Новый Запрос("
		|ВЫБРАТЬ
		|	ЗапрещенныеШтрихКоды.ШтрихКод КАК Префикс
		|ИЗ
		|	РегистрСведений.ЗапрещенныеШтрихКоды КАК ЗапрещенныеШтрихКоды
		|ГДЕ
		|	ЗапрещенныеШтрихКоды.ЭтоПрефикс");
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Сред(ШК,1,СтрДлина(Выборка.Префикс))=СокрЛП(Выборка.Префикс) Тогда
				НайденныйШК=Выборка.Префикс; Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат НЕ ПустаяСтрока(НайденныйШК)
КонецФункции // ШтрихКодЗапрещен()

// Функция поиск товара по штрих-коду
//
// Параметры:
//  ШтрихКод - штрихкод товара, по которому ведется поиск
//
// Возвращаемое значение:
//  ссылка на найденный элемент справочника Номенклатура
//
Функция НайтиПоШтрихКоду(ШтрихКод,ЕстьПрефикс=1,ДополнительноеУсловие=Неопределено) Экспорт
	//ШК=СокрЛП(Формат(ШтрихКод,"ЧГ=0"));
	ШК=Строка(ШтрихКод);
	Если ЕстьПрефикс = 1 Тогда
		Попытка
			ПрефиксШтрихКода=Число(Лев(ШК,2));
		Исключение
			ПрефиксШтрихКода=0;
		КонецПопытки; 
		Попытка
			Если ПрефиксШтрихКода=ПрефиксВесовогоШК Тогда
				//если товар весовой, то ищем по первым семи символам
		    	ШК=Формат(Лев(ШК,7),"ЧГ=0");
			КонецЕсли; 
		Исключение
		КонецПопытки; 
	КонецЕсли;
	
	Запрос = Новый Запрос();
    Запрос.УстановитьПараметр("ШтрихКод", ШК);
	Запрос.Текст = "
    |ВЫБРАТЬ
	|	ШтрихКоды.Объект,
	|	ШтрихКоды.ШтрихКод
	|ИЗ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
    |ГДЕ
	|	ШтрихКоды.ШтрихКод = &ШтрихКод
	|	"+?(ДополнительноеУсловие=Неопределено,"","И "+ДополнительноеУсловие)+"
	|";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
	    Возврат Выборка.Объект;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции // НайтиПоШтрихКоду()

// Функция поиск товара по штрих-коду
//
// Параметры:
//  ШтрихКод - штрих-код товара, по которому ведется поиск
//
// Возвращаемое значение:
//  структура
//
Функция НайтиСтруктуруПоШтрихКоду(ШтрихКод, флРугатьсяНаЗапрещенныйШтрихКод=Ложь) Экспорт
	Попытка
		//ШК=СокрЛП(Формат(ШтрихКод,"ЧГ=0")); Вес=0;
		ШК=Строка(ШтрихКод);
		Попытка
			ПрефиксШтрихКода=Число(Лев(ШК,2));
		Исключение
			ПрефиксШтрихКода=0;
		КонецПопытки; 
		Попытка
			Если ПрефиксШтрихКода=ПрефиксВесовогоШК Тогда
				// Вытащим вес
				Вес=Сред(ШК,7+1,СтрДлина(ШК)-8);
				Если НЕ ПустаяСтрока(Вес) Тогда
					Попытка
						Вес=Число(Сред(ШК,7+1,СтрДлина(ШК)-8))/1000;
					Исключение
						Вес=0;
					КонецПопытки; 
				Иначе
					Вес=0;
				КонецЕсли;
				//если товар весовой, то ищем по первым семи символам
			    ШК=Формат(Лев(ШК,7),"ЧГ=0");
			КонецЕсли; 
		Исключение
		КонецПопытки; 
		
		Запрос = Новый Запрос();
	    Запрос.УстановитьПараметр("ШтрихКод", ШК);
		Запрос.Текст = "
	    |ВЫБРАТЬ
		|	ШтрихКоды.Объект,
		|	ШтрихКоды.ШтрихКод,
		|	ШтрихКоды.ЕдиницаИзмерения,
		|	ШтрихКоды.ХарактеристикаНоменклатуры,
		|	ШтрихКоды.Запрет
		|ИЗ
		|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	    |ГДЕ
		|	ШтрихКоды.ШтрихКод = &ШтрихКод
		|";

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		СтуктураОбъект = Новый Структура();

		Если Выборка.Следующий() Тогда
			Если флРугатьсяНаЗапрещенныйШтрихКод И Выборка.Запрет Тогда
				Предупреждение("Запрещенный штрихкод",3);
				Возврат Неопределено;
			КонецЕсли;
			ТекОбъект = Выборка.Объект;
			Если ТипЗнч(ТекОбъект)=Тип("СправочникСсылка.Номенклатура") Тогда
				//В системе с данным штрихкодом зарегистрирована номенклатура
				ИспользованиеШтрихКодов=ТекОбъект.ТипНоменклатуры.ИспользованиеШтрихКодов;
				СтуктураОбъект.Вставить("Объект",ТекОбъект);
				Если ИспользованиеШтрихКодов = 2 Тогда
					СтуктураОбъект.Вставить("ЕдиницаИзмерения",Выборка.ЕдиницаИзмерения);
				ИначеЕсли ИспользованиеШтрихКодов = 3 Тогда
					СтуктураОбъект.Вставить("ХарактеристикаНоменклатуры",Выборка.ХарактеристикаНоменклатуры);
				КонецЕсли; 
				СтуктураОбъект.Вставить("Вес",Вес);
				Возврат СтуктураОбъект;
			ИначеЕсли ТипЗнч(ТекОбъект)=Тип("СправочникСсылка.Карточки") Тогда
				//В системе с данным штрихкодом зарегистрирована карточка
				СтуктураОбъект.Вставить("Объект",ТекОбъект);
				Возврат СтуктураОбъект;
			КонецЕсли; 
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Исключение
		Предупреждение("Неверный штрихкод",3);
		Возврат Неопределено;
	КонецПопытки;
КонецФункции // НайтиСтруктуруПоШтрихКоду()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТЧИКИ ДЕЙСТВИЙ КОМАНДНОЙ ПАНЕЛИ В КАРТОЧКЕ НОМЕНКЛАТУРЫ

// Создает штрих-код для новых объектов
//
Процедура НовыйОбъектШтрихКод() Экспорт
	Если ТипЗнч(Объект)=Тип("СправочникОбъект.Номенклатура") Тогда
		ИспользованиеШтрихКодов = Объект.ТипНоменклатуры.ИспользованиеШтрихКодов;
		Если ИспользованиеШтрихКодов = 1 Тогда
		    Возврат;
		ИначеЕсли (ИспользованиеШтрихКодов = 2) или (ИспользованиеШтрихКодов = 3) Тогда
	    	Строка = Состав.Добавить();	
			Если ИспользованиеШтрихКодов = 2 Тогда
				Спр = Справочники.ЕдиницыИзмерения;
			Иначе
	        	Спр = Справочники.ХарактеристикиНоменклатуры;
			КонецЕсли;
			Форма = Спр.ПолучитьФормуНовогоЭлемента();
			Форма.Владелец = Объект.Ссылка;
			Форма.ОткрытьМодально();
			ПрочитатьЗаполнитьШтрихКоды();
		КонецЕсли; 
	Иначе
	    Возврат;
	КонецЕсли; 
КонецПроцедуры // НовыйОбъектШтрихКод()

// Копирует штрих-код объекта
//
Процедура КопироватьОбъектШтрихКод(ТекОбъект)  Экспорт
	Если обЗначениеНеЗаполнено(ТекОбъект) Тогда
	    Возврат;	
	КонецЕсли; 
	НовОбъект = ТекОбъект.Скопировать();
	Форма = НовОбъект.ПолучитьФорму();
	Форма.ОткрытьМодально();
	ПрочитатьЗаполнитьШтрихКоды();
КонецПроцедуры // КопироватьОбъектШтрихКод()

// Изменяет штрих код объекта
//
Процедура ИзменитьОбъектШтрихКод(ТекОбъект)  Экспорт
	Если обЗначениеНеЗаполнено(ТекОбъект) Тогда
	    Возврат;	
	КонецЕсли; 
	Форма = ТекОбъект.ПолучитьФорму();
	Форма.ОткрытьМодально();
	ПрочитатьЗаполнитьШтрихКоды();
КонецПроцедуры // ИзменитьОбъектШтрихКод()

// очищаем штрих код в текущей строке
//
Процедура ОчиститьШтрихКод(ТекСтрока)  Экспорт
	Если обЗначениеНеЗаполнено(ТекСтрока) Тогда Возврат; КонецЕсли; 
	ТекСтрока.ШтрихКод="";
КонецПроцедуры // ОчиститьШтрихКод()


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

// инициализируем случайную последовательность
ИндексСлучайных=Неопределено;
НаборСлучайных=Неопределено;
ГСЧ = Новый ГенераторСлучайныхЧисел;

ПрефиксВесовогоШК = Константы.ПрефиксВесовогоШК.Получить();
ПрефиксШтучногоШК = Константы.ПрефиксШтучногоШК.Получить();
#КонецЕсли
